# Binding Properties

---
The Binding type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
Binding Class
Autodesk.Revit.DB Namespace